Revit 2026 API

# DirectShapeTypeGetExternallyTaggedReference Method

---

Retrieve a Reference to reference geometry of the DirectShapeType that is associated with a particular ExternalGeometryId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetExternallyTaggedReference(
	ExternalGeometryId externalId
)
```
```vb
Public Function GetExternallyTaggedReference (
	externalId As ExternalGeometryId
) As Reference
```
```cpp
public:
Reference^ GetExternallyTaggedReference(
	ExternalGeometryId^ externalId
)
```
```fsharp
member GetExternallyTaggedReference :
        externalId : ExternalGeometryId -> Reference
```

#### Parameters

externalId ExternalGeometryId
     The ExternalGeometryId of the requested reference object.

#### Return Value

Reference A Reference to the externally tagged reference GeometryObject having the provided external ID or  if there is no reference geometry having the external ID.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectShapeType Class

Autodesk.Revit.DB Namespace